tutorials/incompressible/pimpleFoam/laminar/inclinedPlaneFilm/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh

runApplication decomposePar

runParallel makeFaMesh

runParallel $(getApplication)

runApplication reconstructPar

#------------------------------------------------------------------------------
